EDT/УТ/src/Catalogs/зпНачисления/зпНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>зпНачисления</name>
  <predefined>
    <items>
      <name>ВыполнениеЗабора</name>
      <description>Выполнение забора</description>
    </items>
    <items>
      <name>ВыполнениеФрахта</name>
      <description>Выполнение фрахта</description>
    </items>
    <items>
      <name>ДоплатаДоМинимальногоРазмераОплаты</name>
      <description>Доплата до минимального размера оплаты</description>
    </items>
    <items>
      <name>ДоплатаЗаПарковку</name>
      <description>Доплата за парковку</description>
    </items>
    <items>
      <name>ДоплатаЗаПробег</name>
      <description>Доплата за пробег</description>
    </items>
    <items>
      <name>ДоплатаЗаПробегЗаМКАД</name>
      <description>Доплата за пробег (за МКАД)</description>
    </items>
    <items>
      <name>ДоплатаЗаЧасыПереработки</name>
      <description>Доплата за часы переработки</description>
    </items>
    <items>
      <name>ДоплатаЗаЭкспедирование</name>
      <description>Доплата за экспедирование</description>
    </items>
    <items>
      <name>ДоставкаЗаказа</name>
      <description>Доставка заказа</description>
    </items>
    <items>
      <name>ДоставкаЗаказаVIP</name>
      <description>Доставка заказа (VIP)</description>
    </items>
    <items>
      <name>МагистральныйРейс</name>
      <description>Магистральный рейс</description>
    </items>
    <items>
      <name>НочнойВодитель</name>
      <description>Ночной водитель</description>
    </items>
    <items>
      <name>ОплатаПоСменам</name>
      <description>Оплата по сменам</description>
    </items>
    <items>
      <name>ОплатаПодъемаНаЭтажПриДоставкеЗаказа</name>
      <description>Оплата подъема на этаж (доставка заказа)</description>
    </items>
    <items>
      <name>Примерка</name>
      <description>Примерка</description>
    </items>
  </predefined>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.зпСпособыРасчетаНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетЧасовПереработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОбслуживанияДоставки</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисления</name>
    <type>
      <types>EnumRef.зпВидыНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеНачислениеИспользуетсяВФиксацииНачислений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоУмолчаниюВФиксацииНачислений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачислениеНеАктуально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Enums/зпВидыНачислений/зпВидыНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>зпВидыНачислений</name>
  <enumValues>
    <name>ОсновноеНачисление</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеНачисление</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/зпНачисления/Forms/ФормаВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФиксацияДополнительныхНачисленийУдержаний = Параметры.Свойство("ФиксацияДополнительныхНачисленийУдержаний");
	Если ФиксацияДополнительныхНачисленийУдержаний Тогда
		ИмяОтбора = "БыстрыйОтбор";
		ГруппаЭлементовОтбора = ОбщегоНазначенияКлиентСервер83.СоздатьГруппуЭлементовОтбора(Список.Отбор.Элементы, ИмяОтбора, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(ГруппаЭлементовОтбора, "ВидНачисления", Перечисления.зпВидыНачислений.ДополнительноеНачисление, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(ГруппаЭлементовОтбора, "ДополнительноеНачислениеИспользуетсяВФиксацииНачислений", Истина, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		
		Элементы.ВидНачисления.Видимость = Ложь;
		Элементы.СпособРасчета.Видимость = Ложь;
		Элементы.КоличествоРабочихЧасов.Видимость = Ложь;
		Элементы.УчетЧасовПереработки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ФиксацияДополнительныхНачисленийУдержаний Тогда
		Отказ = Истина;
		ОткрытьФорму("Справочник.зпНачисления.Форма.ФиксацияДополнительныхНачисленийУдержаний");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Если ФиксацияДополнительныхНачисленийУдержаний Тогда
		Отказ = Истина;
		ОткрытьФорму("Справочник.зпНачисления.Форма.ФиксацияДополнительныхНачисленийУдержаний", Новый Структура("Ключ", Элементы.Список.ТекущиеДанные.Ссылка));
	КонецЕсли;
	
КонецПроцедуры
